In [ ]:
data.loc['two'],['Colorado','Utah']

In [5]:
# Introduction to Pandas Data Structures (Series)

In [6]:
import pandas as pd

In [7]:
obj = pd.Series([4,7,-5,3])

In [8]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [9]:
obj.values

array([ 4,  7, -5,  3], dtype=int64)

In [10]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [11]:
obj2 = pd.Series([4,7,-5,3], index = ['d','b','a','c'])

In [12]:
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [13]:
obj2.index

Index(['d', 'b', 'a', 'c'], dtype='object')

In [14]:
obj2['a']

-5

In [16]:
obj2[['c','a','d']]

c    3
a   -5
d    4
dtype: int64

In [17]:
obj2[obj2 > 2]

d    4
b    7
c    3
dtype: int64

In [18]:
obj2 * 2

d     8
b    14
a   -10
c     6
dtype: int64

In [20]:
import numpy as np

In [21]:
np.exp(obj2)

d      54.598150
b    1096.633158
a       0.006738
c      20.085537
dtype: float64

In [22]:
'b' in obj2

True

In [23]:
'e' in obj2

False

In [24]:
sdata = {'Ohio':3500, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}

In [25]:
sdata

{'Ohio': 3500, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}

In [26]:
obj3 = pd.Series(sdata)

In [27]:
obj3

Ohio       3500
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [31]:
states = ['California', 'Ohio', 'Oregon','Texas']

In [32]:
obj4 = pd.Series(sdata,index=states)

In [33]:
obj4

California        NaN
Ohio           3500.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [35]:
pd.notnull(obj4)

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [36]:
obj3

Ohio       3500
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [37]:
obj4

California        NaN
Ohio           3500.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [38]:
obj3 + obj4

California         NaN
Ohio            7000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

In [39]:
obj4.name = 'population'

In [40]:
obj4

California        NaN
Ohio           3500.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

In [41]:
obj4.index.name = 'state'

In [42]:
obj4

state
California        NaN
Ohio           3500.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

In [43]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [44]:
obj.index = ['Bob','Steve', 'Jeff', 'Ryan']

In [45]:
obj

Bob      4
Steve    7
Jeff    -5
Ryan     3
dtype: int64

In [48]:
#DataFrame: Represents a rectangular table of data and contains an ordered collection of columns, each of which can be  a different value type. The DataFrame has both a row and column index, it can be thought of as a dict of Series all sharing the same index. Under the hood, the data is stored as one or more two- dimensional blocls rather than a list, dict, or some other collection of one-dimensional array.

In [49]:
data = {'states': ['Ohio','Ohio','Ohio','Nevada','Nevada','Nevada'],
        'year': [2000,2001,2002,2001,2002,2003],
        'pop':[1.5,1.7,3.6,2.4,2.9,3.2]}

frame = pd.DataFrame(data)

In [50]:
data

{'states': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
 'year': [2000, 2001, 2002, 2001, 2002, 2003],
 'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}

In [51]:
frame

   states  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [52]:
frame.head()

   states  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [56]:
pd.DataFrame(data, columns=['year','states','pop'])

   year  states  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

In [57]:
frame2 = pd.DataFrame(data,columns=['year','states','pop','debt'],
                        index=['one','two','three','four','five','six'])

In [58]:
frame2

       year  states  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN
six    2003  Nevada  3.2  NaN

In [59]:
frame2.columns

Index(['year', 'states', 'pop', 'debt'], dtype='object')

In [64]:
frame2.states

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
six      Nevada
Name: states, dtype: object

In [62]:
frame2.year

one      2000
two      2001
three    2002
four     2001
five     2002
six      2003
Name: year, dtype: int64

In [63]:
frame2['year']

one      2000
two      2001
three    2002
four     2001
five     2002
six      2003
Name: year, dtype: int64

In [65]:
frame2.loc['three']

year      2002
states    Ohio
pop        3.6
debt       NaN
Name: three, dtype: object

In [66]:
#Asigning scalar value to 'debt' column

In [67]:
frame2['debt']= 16.5

In [68]:
frame2

       year  states  pop  debt
one    2000    Ohio  1.5  16.5
two    2001    Ohio  1.7  16.5
three  2002    Ohio  3.6  16.5
four   2001  Nevada  2.4  16.5
five   2002  Nevada  2.9  16.5
six    2003  Nevada  3.2  16.5

In [69]:
frame2['debt'] = np.arange(6.)

In [70]:
frame2

       year  states  pop  debt
one    2000    Ohio  1.5   0.0
two    2001    Ohio  1.7   1.0
three  2002    Ohio  3.6   2.0
four   2001  Nevada  2.4   3.0
five   2002  Nevada  2.9   4.0
six    2003  Nevada  3.2   5.0

In [72]:
# The value's length must match the lenght of the DataFrame. The missing values will be labeled as Missing Values.

In [73]:
val = pd.Series([-1.2, -1.5, -1.7], index=['two','four','five'])

In [74]:
frame2['debt'] = val

In [75]:
frame2

       year  states  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7
six    2003  Nevada  3.2   NaN

In [76]:
# Asigning a column that doesn't exist will create a new column. The del keyword will delete columns as with a dict.

In [78]:
frame2['eastern'] = frame.states == 'Ohio'

In [79]:
frame2

       year  states  pop  debt eastern
one    2000    Ohio  1.5   NaN     NaN
two    2001    Ohio  1.7  -1.2     NaN
three  2002    Ohio  3.6   NaN     NaN
four   2001  Nevada  2.4  -1.5     NaN
five   2002  Nevada  2.9  -1.7     NaN
six    2003  Nevada  3.2   NaN     NaN

In [80]:
del frame2['eastern']

In [81]:
frame2.columns

Index(['year', 'states', 'pop', 'debt'], dtype='object')

In [82]:
frame2

       year  states  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7
six    2003  Nevada  3.2   NaN

In [83]:
# Another form of data is a nested dict or dicts:

In [84]:
pop = {'Nevada': {2001:2.4, 2004:2.9},
        'Ohio': {2000:1.5, 2001:1.7, 2002: 3.6}}

In [85]:
frame3 = pd.DataFrame(pop)

In [86]:
frame3

      Nevada  Ohio
2001     2.4   1.7
2004     2.9   NaN
2000     NaN   1.5
2002     NaN   3.6

In [87]:
# Transpose Data

In [88]:
frame3.T

        2001  2004  2000  2002
Nevada   2.4   2.9   NaN   NaN
Ohio     1.7   NaN   1.5   3.6

In [89]:
pd.DataFrame(pop, index=[2001,2002,2003])

      Nevada  Ohio
2001     2.4   1.7
2002     NaN   3.6
2003     NaN   NaN

In [90]:
pdata = {'Ohio': frame3['Ohio'][:-1],
        'Nevada': frame3['Nevada'][:2]}

In [92]:
pd.DataFrame(pdata)

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4
2004   NaN     2.9

In [93]:
frame3.index.name = 'year'; frame3.columns.name = 'states'

In [94]:
frame3

states  Nevada  Ohio
year
2001       2.4   1.7
2004       2.9   NaN
2000       NaN   1.5
2002       NaN   3.6

In [95]:
frame3.values

array([[2.4, 1.7],
       [2.9, nan],
       [nan, 1.5],
       [nan, 3.6]])

In [96]:
#Index Objects

In [97]:
obj = pd.Series(range(3), index=['a','b','c'])

In [98]:
obj

a    0
b    1
c    2
dtype: int64

In [99]:
index = obj.index

In [100]:
index

Index(['a', 'b', 'c'], dtype='object')

In [101]:
index[1:]

Index(['b', 'c'], dtype='object')

In [105]:
index[1]

'b'

In [106]:
labels = pd.Index(np.arange(3))

In [107]:
labels

Int64Index([0, 1, 2], dtype='int64')

In [117]:
obj2 = pd.Series([1.5, -2.5, 0], index=labels)

In [118]:
obj2

0    1.5
1   -2.5
2    0.0
dtype: float64

In [119]:
obj2.index is labels

True

In [120]:
frame3

states  Nevada  Ohio
year
2001       2.4   1.7
2004       2.9   NaN
2000       NaN   1.5
2002       NaN   3.6

In [121]:
frame3.columns

Index(['Nevada', 'Ohio'], dtype='object', name='states')

In [122]:
'Ohio' in frame3.columns

True

In [123]:
2003 in frame3.index

False

In [124]:
#Pandas index can contain duplicate labels

In [127]:
dup_labels = pd.Index(['foo','foo','bar','bar'])

In [128]:
dup_labels

Index(['foo', 'foo', 'bar', 'bar'], dtype='object')

In [129]:
#Essential Functionality

In [130]:
#Reindexing

In [131]:
obj = pd.Series([4.5,7.2,-5.3,3.6], index=['d','b','a','c'])

In [132]:
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [136]:
obj2 = obj.reindex(['a','b','c','d','e'])

In [137]:
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [138]:
obj3 = pd.Series(['Blue','purple','yellow'], index=[0,2,4])

In [139]:
obj3

0      Blue
2    purple
4    yellow
dtype: object

In [143]:
obj3.reindex(range(6),method='ffill')

0      Blue
1      Blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [144]:
#Alter row/column or both

In [147]:
frame = pd.DataFrame(np.arange(9).reshape((3,3)),
                      index=['a','c','d'],
                      columns=['Ohio','Texas','California'])

In [148]:
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [149]:
frame2 = frame.reindex(['a','b','c','d'])

In [150]:
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [151]:
#The columns can be reindexed with the columns keyword

In [152]:
states = ['Texas','Utah','California']

In [153]:
frame.reindex(columns=states)

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [155]:
#Dropping Entries from an Axis

In [156]:
obj = pd.Series(np.arange(5.), index=['a','b','c','d','e'])

In [157]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [158]:
new_obj = obj.drop('c')

In [159]:
new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [161]:
obj.drop(['c','d'])

a    0.0
b    1.0
e    4.0
dtype: float64

In [162]:
new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [163]:
# With DataFrame , index can be deleted form either axis.

In [181]:
data = pd.DataFrame(np.arange(16).reshape((4,4)),
                      index=['Ohio','Colorado','Utah','NY'],
                      columns=['one','two','three','four'])

In [182]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
NY         12   13     14    15

In [183]:
data.drop(['Colorado','Ohio'])

      one  two  three  four
Utah    8    9     10    11
NY     12   13     14    15

In [184]:
data.drop('two', axis=1)

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
NY         12     14    15

In [185]:
data.drop(['two','four'], axis= 'columns')

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
NY         12     14

In [186]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [187]:
obj.drop('c', inplace=True)

In [188]:
obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [190]:
#Indexing, Selecting and Filtering

In [191]:
obj = pd.Series(np.arange(4.), index=['a','b','c','d'])

In [192]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [193]:
obj['b':'c'] = 5

In [194]:
obj

a    0.0
b    5.0
c    5.0
d    3.0
dtype: float64

In [4]:
import pandas as pd

In [13]:
import numpy as np

In [14]:
data = pd.DataFrame(np.arange(16).reshape((4,4)),
                  index=['Ohio','Colorado','Utah','NY'],
                  columns=['one','two','three','four'])

In [15]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
NY         12   13     14    15

In [16]:
data['two']

Ohio         1
Colorado     5
Utah         9
NY          13
Name: two, dtype: int32

In [17]:
data[['three','one']]

          three  one
Ohio          2    0
Colorado      6    4
Utah         10    8
NY           14   12

In [18]:
data[:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [19]:
data[data['three'] > 5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
NY         12   13     14    15

In [20]:
data < 5

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
NY        False  False  False  False

In [21]:
data[data < 5] = 0

In [22]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
NY         12   13     14    15

In [23]:
#Selection with Loc and iloc

In [24]:
data.loc['Colorado',['two','three']]

two      5
three    6
Name: Colorado, dtype: int32

In [25]:
data.iloc[2,[3,0,1]]

four    11
one      8
two      9
Name: Utah, dtype: int32

In [30]:
data.iloc[3]

one      12
two      13
three    14
four     15
Name: NY, dtype: int32

In [29]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
NY         12   13     14    15

In [31]:
data.iloc[1,2]

6

In [32]:
data.iloc[[1,2],[3,0,1]]

          four  one  two
Colorado     7    0    5
Utah        11    8    9

In [35]:
data.loc[:'Utah', 'two']

Ohio        0
Colorado    5
Utah        9
Name: two, dtype: int32

In [38]:
data.iloc[:, :3][data.three > 5]

          one  two  three
Colorado    0    5      6
Utah        8    9     10
NY         12   13     14

In [39]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
NY         12   13     14    15

In [40]:
# Integer Indexes

In [42]:
ser = pd.Series(np.arange(3.))

In [43]:
ser

0    0.0
1    1.0
2    2.0
dtype: float64

In [45]:
ser[1]

1.0

In [50]:
ser2 = pd.Series(np.arange(3.), index = ['a','b','c'])

In [51]:
ser2

a    0.0
b    1.0
c    2.0
dtype: float64

In [52]:
ser2[-1]

2.0

In [53]:
ser[-1]

KeyError: -1

In [54]:
ser[:2]

0    0.0
1    1.0
dtype: float64

In [55]:
#Arithmetic and Data Alignment

In [56]:
s1 = pd.Series([7.3, -2.5, 3.4, 1.5], index = [ 'a','c','d','e'])

In [57]:
s2 = pd.Series([-2.1, 3.6, -1.5, 4, 3.1], index= ['a','c','e','f','g'])

In [58]:
s1

a    7.3
c   -2.5
d    3.4
e    1.5
dtype: float64

In [59]:
s2

a   -2.1
c    3.6
e   -1.5
f    4.0
g    3.1
dtype: float64

In [60]:
s1 + s2

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

In [61]:
# The internal data alignment introduces missing values in the label location that dont overlap. 
# Missing values will then propagate in further arithmetic computations

In [63]:
df1 = pd.DataFrame(np.arange(9.).reshape((3,3)), columns= list('bcd'), index= ['Ohio', 'Texas', 'Colorado'])

In [64]:
df1

            b    c    d
Ohio      0.0  1.0  2.0
Texas     3.0  4.0  5.0
Colorado  6.0  7.0  8.0

In [68]:
df2 = pd.DataFrame(np.arange(12.).reshape((4,3)),columns=(['b','d','e']), index=['Utah','Ohio','Texas','Oregon'])

In [69]:
df2

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [70]:
df1 + df2

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

In [71]:
# Since column 'c' and 'e' are not found in both DataFrames, they appear as all missing in the result

In [72]:
df1 = pd.DataFrame({'A': [1,2]})

In [73]:
df1

   A
0  1
1  2

In [74]:
df2 = pd.DataFrame({'B': [1,2]})

In [75]:
df2

   B
0  1
1  2

In [76]:
df1 - df2

    A   B
0 NaN NaN
1 NaN NaN

In [77]:
# Arithmetic methods with fill values

In [81]:
df1 = pd.DataFrame(np.arange(12.).reshape((3,4)), columns= list('abcd'), index=([0,1,2]))

In [82]:
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [86]:
df2 = pd.DataFrame(np.arange(20.).reshape((4,5)), columns= list('abcde'), index= ([0,1,2,3]))

In [87]:
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   6.0   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [88]:
df1 + df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0  11.0  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [89]:
df1.add(df2, fill_value = 0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0  11.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [90]:
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [91]:
1 / df1

       a         b         c         d
0    inf  1.000000  0.500000  0.333333
1  0.250  0.200000  0.166667  0.142857
2  0.125  0.111111  0.100000  0.090909

In [92]:
df1.rdiv(1)

       a         b         c         d
0    inf  1.000000  0.500000  0.333333
1  0.250  0.200000  0.166667  0.142857
2  0.125  0.111111  0.100000  0.090909

In [93]:
# When reindexing a Series or DataFrame, you can also specify a different fill value

In [94]:
df1.reindex(columns=df2.columns, fill_value=0)

     a    b     c     d  e
0  0.0  1.0   2.0   3.0  0
1  4.0  5.0   6.0   7.0  0
2  8.0  9.0  10.0  11.0  0

In [96]:
#Operations between DataFrame and Series

In [97]:
arr = np.arange(12.).reshape((3,4))

In [98]:
arr

array([[ 0.,  1.,  2.,  3.],
       [ 4.,  5.,  6.,  7.],
       [ 8.,  9., 10., 11.]])

In [99]:
arr[0]

array([0., 1., 2., 3.])

In [100]:
arr - arr[0]

array([[0., 0., 0., 0.],
       [4., 4., 4., 4.],
       [8., 8., 8., 8.]])

In [101]:
# When substract arr[0] from ar, the substraction is performed once for each row. This is referred to as broadcasting.

In [102]:
#Operations between a DataFrame and a Series are similar

In [103]:
frame = pd.DataFrame(np.arange(12.).reshape((4,3)), columns= list('bde'), index= (['Utah','Ohio','Texas','Oregon']))

In [104]:
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [106]:
series = frame.iloc[0]

In [107]:
series

b    0.0
d    1.0
e    2.0
Name: Utah, dtype: float64

In [108]:
frame - series

          b    d    e
Utah    0.0  0.0  0.0
Ohio    3.0  3.0  3.0
Texas   6.0  6.0  6.0
Oregon  9.0  9.0  9.0

In [109]:
# if an index value is not found in either the DataFrame columns or the Series index, the objects will be reindexed to form the union

In [110]:
series2 = pd.Series(range(3), index=['b','e','f'])

In [111]:
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [112]:
series2

b    0
e    1
f    2
dtype: int64

In [113]:
frame + series2

          b   d     e   f
Utah    0.0 NaN   3.0 NaN
Ohio    3.0 NaN   6.0 NaN
Texas   6.0 NaN   9.0 NaN
Oregon  9.0 NaN  12.0 NaN

In [114]:
# If you want instead broadcast over the columns, matching on the rows, oyu have to use one of the arithmetic methods

In [115]:
series3 = frame['d']

In [116]:
series3

Utah       1.0
Ohio       4.0
Texas      7.0
Oregon    10.0
Name: d, dtype: float64

In [118]:
frame.sub(series3, axis=0 )

          b    d    e
Utah   -1.0  0.0  1.0
Ohio   -1.0  0.0  1.0
Texas  -1.0  0.0  1.0
Oregon -1.0  0.0  1.0

In [119]:
# Function Application and Mapping

In [122]:
frame = pd.DataFrame(np.random.randn(4,3), columns= list('bde'), index= (['Utah','Ohio','Texas','Oregon']))

In [123]:
frame

               b         d         e
Utah    1.236916 -0.187258 -0.761039
Ohio    1.002613 -2.291581 -1.413528
Texas   0.523361 -0.062258  0.400950
Oregon  0.408554  1.336229  1.572497

In [124]:
np.abs(frame)

               b         d         e
Utah    1.236916  0.187258  0.761039
Ohio    1.002613  2.291581  1.413528
Texas   0.523361  0.062258  0.400950
Oregon  0.408554  1.336229  1.572497

In [125]:
# Another operation is applying a function on one- dimensional array to each column or row. DataFrame apply method:

In [126]:
f = lambda x:x.max() - x.min()

In [127]:
frame.apply(f)

b    0.828363
d    3.627811
e    2.986026
dtype: float64

In [149]:
test = pd.DataFrame(np.arange(8).reshape(4,2),columns=(['A','B']),
 index= (['qq','aa','ss','vv']))

In [150]:
test

    A  B
qq  0  1
aa  2  3
ss  4  5
vv  6  7

In [144]:
test_f = lambda x:x.max() - x.min()

In [145]:
test.apply(test_f)

A    6
B    6
dtype: int64

In [151]:
test.apply(test_f,axis='columns')

qq    1
aa    1
ss    1
vv    1
dtype: int64

In [152]:
# The function passed to apply doesnt need to return a scalar value, it can also return a Series with multiple values

In [157]:
def test_f(x):
    return pd.Series([x.min(), x.max()], index=['min','max'])

In [158]:
test.apply(test_f)

     A  B
min  0  1
max  6  7

In [159]:
# Suppose we wanted to compute a formatted string from each floating-point value in frame. You can do this with apply map

In [160]:
format = lambda x: '%.2f' % x

In [161]:
frame.applymap(format)

           b      d      e
Utah    1.24  -0.19  -0.76
Ohio    1.00  -2.29  -1.41
Texas   0.52  -0.06   0.40
Oregon  0.41   1.34   1.57

In [162]:
frame['e'].map(format)

Utah      -0.76
Ohio      -1.41
Texas      0.40
Oregon     1.57
Name: e, dtype: object

In [163]:
#Sorting and Ranking

In [164]:
obj = pd.DataFrame(np.arange(4), index=list('dabc'))

In [165]:
obj

   0
d  0
a  1
b  2
c  3

In [166]:
obj.sort_index()

   0
a  1
b  2
c  3
d  0

In [167]:
# Sorting by axis

In [176]:
frame = pd.DataFrame(np.arange(8).reshape(2,4), columns=list('dabc'), index=(['three','one']))

In [177]:
frame

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [178]:
frame.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [179]:
frame.sort_index(axis=1)

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [180]:
frame.sort_index(axis=1, ascending=False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

In [181]:
obj = pd.Series([4,7,-3,2])

In [182]:
obj

0    4
1    7
2   -3
3    2
dtype: int64

In [183]:
obj.sort_values()

2   -3
3    2
0    4
1    7
dtype: int64

In [184]:
# Any missing values are sorted to the end of the series by default

In [185]:
obj = pd.Series([4,np.nan,7,np.nan, -3, 2])

In [186]:
obj

0    4.0
1    NaN
2    7.0
3    NaN
4   -3.0
5    2.0
dtype: float64

In [187]:
obj.sort_values()

4   -3.0
5    2.0
0    4.0
2    7.0
1    NaN
3    NaN
dtype: float64

In [188]:
# When sorting DataFrame you can use the data in one or more columns as the sort keys

In [189]:
frame = pd.DataFrame({'b':[4,7,-3,2],'a':[0,1,0,1]})

In [190]:
frame

   b  a
0  4  0
1  7  1
2 -3  0
3  2  1

In [192]:
frame.sort_values(by='b', ascending=False)

   b  a
1  7  1
0  4  0
3  2  1
2 -3  0

In [194]:
frame.sort_values(by=['a','b'], ascending=False)

   b  a
1  7  1
3  2  1
0  4  0
2 -3  0

In [195]:
obj = pd.Series([7,-2,7,4,3,2,0])

In [196]:
obj.rank()

0    6.5
1    1.0
2    6.5
3    5.0
4    4.0
5    3.0
6    2.0
dtype: float64

In [198]:
obj.rank(method='max')

0    7.0
1    1.0
2    7.0
3    5.0
4    4.0
5    3.0
6    2.0
dtype: float64

In [199]:
# Axis Indexes with Duplicate Labels

In [200]:
obj = pd.Series(range(5), index=['a','a','b','b','c'])

In [201]:
obj

a    0
a    1
b    2
b    3
c    4
dtype: int64

In [202]:
obj.index.is_unique

False

In [203]:
obj['a']

a    0
a    1
dtype: int64

In [204]:
df = pd.DataFrame(np.random.rand(4,3), index=(['a','a','b','b']))

In [205]:
df

          0         1         2
a  0.606790  0.512310  0.720517
a  0.500583  0.524761  0.718597
b  0.685185  0.464467  0.114848
b  0.482698  0.365137  0.293914

In [207]:
df.loc['b']

          0         1         2
b  0.685185  0.464467  0.114848
b  0.482698  0.365137  0.293914

In [208]:
#Summarizing and Computing Descriptive Statistics

In [209]:
df = pd.DataFrame([[1.4,np.nan],[7.1, -4.5], [np.nan, np.nan], [0.75, -1.3]], index= list('abcd'), columns=['one','two'])

In [210]:
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [211]:
df.sum()

one    9.25
two   -5.80
dtype: float64

In [212]:
df.sum(axis='columns')

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [213]:
# NA values are excluded unless the entire slice is NA. This can be desabled with the skipna option:

In [214]:
df.mean(axis='columns', skipna=False)

a      NaN
b    1.300
c      NaN
d   -0.275
dtype: float64

In [215]:
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [216]:

df.idxmin()

one    d
two    b
dtype: object

In [217]:
df.idxmax()

one    b
two    d
dtype: object

In [218]:
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [219]:
# On non- numerica data , describe method produces alternative summary statistics

In [220]:
obj = pd.Series(['a','a','b','c'] * 4)

In [221]:
obj

0     a
1     a
2     b
3     c
4     a
5     a
6     b
7     c
8     a
9     a
10    b
11    c
12    a
13    a
14    b
15    c
dtype: object

In [222]:
obj.describe()

count     16
unique     3
top        a
freq       8
dtype: object